For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

Has the network latency gone up since we switched internet service providers?

Data SOurces:
- Pre imposed speed check platforms
- Surveys

$h_0$ - Network Latency has not changed since switching internet providers

$h_a$ - Network latency is significantly faster since switching provider


True Positive:
   - low p-value < alpha
   - reject $H_0$
   - average speed for new network is 93.98
   - average speed of all networks 80
   
False Positive:
   - small p-value
   - reject $H_0$
   - average speed for new network was taken during non-peak time and compared to averages of peak time usuage

True Negative:
   - higher p-value
   - fail to reject $H_0$
   - avg speed for new newtwork: 93.98
   - avg speed of all networks: 92
   
False Negative:
   - higher p-value
   - fail to reject $H_0$
   - avg speed of all networks was taken during peak time and being compared to an averagethat was take during non peak time

Is the website redesign any good?

Data Source
- heat map of clicks
- surveys

$H_0$ - Website redisgn has had no impact on click rate

$H_a$ - Website redisgn has had a drastic impact on click rates


True Positive:
   - concentrated rate of clicks on areas that are actionable
   
False Positive:
   - heat map of previous web design is from several redesigns ago as opposed to the most recent version
    
True Negative:
   - heat map of clicks is the same as before redesign
       
False Negative:
   - heat maps were taken during different times of day

Is our television ad driving more sales?
Data Source
- Surveys
- promo codes
- outside marketing firm

$H_0$ - Televison ads have no impact on consumer buying rates

$H_a$ - Television ads drastically drives consumer buying rates

True Positive:
   - sales of the product that has been advertised has seen a spike in sales

False Positive:
   - a natural disaster has just occured causing a surge on various poducts

True Negative:
   - sales of product that was being advertised on TV has not seen a spike in sales and has remained neutral

False Negative:
   - ad ran during non-peak times

# T-Test

Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. Use a .05 level of significance.

$H_0$ - average time to sell homes is the same at both locations.

$H_a$ - average time to sell home is not the same at both locations

In [1]:
from math import sqrt

%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd

import datetime

from scipy import stats


# x1 = df[df.study_strategy == 'flashcards'].exam_score
# x2 = df[df.study_strategy == 'Winged It'].exam_score

alpha = .05

xbar1 = 90
xbar2 = 100

n1 = 40
n2 = 50

s1 = 15
s2 = 20

degf = (n1 + n2) - 2 # n - number of categories

s_p = sqrt(
    ((n1 - 1) * s1**2 + (n2 - 1) * s2**2)
    /
    (n1 + n2 - 2)
)

t = (xbar1 - xbar2) / (s_p * sqrt(1 / n1 + 1 / n2))

In [2]:
s_p

17.956702977389302

In [3]:
t

-2.6252287036468456

In [4]:
p = stats.t(degf).sf(abs(t)) * 2

In [5]:
p

0.01020985244923939

In [6]:
print(f'''
Because p ({p:.6f}) < alpha ({alpha}), we reject the null hypothesis:
average time to sell homes is the same at both locations
''')

Because p (0.010210) < alpha (0.05), we reject the null hypothesis:
average time to sell homes is the same at both locations

Load the mpg dataset and use it to answer the following questions:

- Is there a difference in fuel-efficiency in cars from 2008 vs 1999?
- Are compact cars more fuel-efficient than the average car?
- Do manual cars get better gas mileage than automatic cars?

$H_0$ - There is no difference in hwy fuel-efficiency for cars from 2008 nd 1999

$H_a$ - There is a difference in hwy fuel-efficiency for cars from 2008 nd 1999

In [7]:
from pydataset import data
alpha = .05

In [8]:
mpg = data("mpg")

In [9]:
mpg.sample(10)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
77,ford,expedition 2wd,5.4,2008,8,auto(l6),r,12,18,r,suv
57,dodge,dakota pickup 4wd,5.2,1999,8,auto(l4),4,11,15,r,pickup
121,hyundai,tiburon,2.7,2008,6,manual(m6),f,16,24,r,subcompact
83,ford,explorer 4wd,5.0,1999,8,auto(l4),4,13,17,r,suv
82,ford,explorer 4wd,4.6,2008,8,auto(l6),4,13,19,r,suv
173,subaru,impreza awd,2.5,2008,4,manual(m5),4,20,27,r,compact
59,dodge,durango 4wd,4.7,2008,8,auto(l5),4,13,17,r,suv
139,mercury,mountaineer 4wd,4.0,2008,6,auto(l5),4,13,19,r,suv
157,pontiac,grand prix,3.8,1999,6,auto(l4),f,17,27,r,midsize
61,dodge,durango 4wd,4.7,2008,8,auto(l5),4,13,17,r,suv

In [10]:
x1 = mpg[mpg.year == 2008].hwy

In [11]:
x2 = mpg[mpg.year == 1999].hwy

In [12]:
t_stat, p = stats.ttest_ind(x1, x2)

In [13]:
t_stat

0.03286431672888292

In [14]:
p

0.9738110448529322

In [15]:
print(f'''
Because p ({p:.4}) > alpha ({alpha}), we fail to reject the null hypothesis
''')

Because p (0.9738) > alpha (0.05), we fail to reject the null hypothesis

$H_0$ - There is no difference in hwy fuel efficency between compact cars and regular cars

$H_a$ - There is a difference in hwy fuel efficency between compact cars and regular cars

In [16]:
x1 = mpg[mpg["class"] == "compact"].hwy

In [17]:
x2 = mpg[mpg["class"] != "compact"].hwy

In [18]:
t_stat, p = stats.ttest_ind(x1, x2)

In [19]:
t_stat

6.844017913682101

In [20]:
p

6.802262127570768e-11

In [21]:
print(f'''
Because p ({p:.12f}) < alpha ({alpha}), we reject the null hypothesis
''')

Because p (0.000000000068) < alpha (0.05), we reject the null hypothesis

$H_0$ - Both manual cars and automatic cars get the same hwy gas mileage

$H_a$ - The hwy gas mileage is different for manual cars and automatic cars

In [22]:
alpha = 0.05

In [23]:
x1 = mpg[mpg["trans"].str.contains("manual")].hwy

In [24]:
x2 = mpg[mpg["trans"].str.contains("auto")].hwy

In [25]:
t_stat, p = stats.ttest_ind(x1, x2)

In [26]:
t_stat

4.368349972819688

In [27]:
p

1.888044765552951e-05

In [28]:
print(f'''
Because p ({p:.7f}) < alpha ({alpha}), we reject the null hypothesis
''')

Because p (0.0000189) < alpha (0.05), we reject the null hypothesis

# Pearson's Correlation Coefficient

1. Use the telco_churn data. Does tenure correlate with monthly charges? Total charges? What happens if you control for phone and internet service?

In [29]:
from env import get_db_url
url = get_db_url("telco_churn")

In [30]:
telco_churn = pd.read_sql("SELECT * FROM customers", url)

In [31]:
telco_churn.sample(10)

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
3817,5366-OBVMR,Female,0,Yes,No,18,Yes,No,1,No,...,No,Yes,No,No,1,Yes,2,50.30,908.75,No
6729,9555-SAHUZ,Female,0,Yes,Yes,38,Yes,No,1,Yes,...,No,No,No,No,1,No,1,54.50,2076.05,No
891,1301-LOPVR,Male,0,Yes,Yes,29,No,No phone service,1,Yes,...,Yes,Yes,No,Yes,2,Yes,4,55.35,1636.95,No
5923,8337-UPOAQ,Male,1,Yes,No,10,Yes,Yes,2,No,...,Yes,No,No,Yes,1,Yes,1,89.80,914.3,Yes
5189,7299-GNVPL,Female,0,Yes,Yes,23,Yes,No,2,Yes,...,No,Yes,No,No,1,No,2,84.40,1936.85,No
6522,9253-VIFJQ,Male,0,Yes,No,65,Yes,Yes,1,Yes,...,Yes,No,No,No,2,No,4,67.05,4309.55,No
3591,5090-EMGTC,Female,0,Yes,No,59,Yes,No,2,No,...,No,Yes,Yes,Yes,3,Yes,2,100.05,6034.85,No
4846,6833-JMZYP,Female,0,No,No,15,Yes,No,2,No,...,Yes,No,Yes,Yes,1,Yes,4,94.00,1505.45,No
3979,5605-XNWEN,Male,1,Yes,No,72,Yes,Yes,3,No internet service,...,No internet service,No internet service,No internet service,No internet service,3,Yes,3,25.00,1802.55,No
5575,7853-OETYL,Female,0,Yes,No,4,No,No phone service,1,Yes,...,No,No,No,No,1,Yes,1,29.05,129.6,No

$H_0$ - There is no linear correlation between tenure and monthly charges

$H_a$ - There is a linear correlation between tenure and monthly charges

In [32]:
telco_churn.total_charges = telco_churn.total_charges.str.replace(" ","")

In [33]:
telco_churn.total_charges = pd.to_numeric(telco_churn.total_charges)

In [34]:
telco_churn.total_charges = telco_churn.total_charges.fillna(0)

In [35]:
x = telco_churn.tenure
y = telco_churn.total_charges
y

0        593.30
1        542.40
2        280.85
3       1237.85
4        267.40
         ...
7038     742.90
7039    1873.70
7040      92.75
7041    4627.65
7042    3707.60
Name: total_charges, Length: 7043, dtype: float64

In [36]:
r, p = stats.pearsonr(x, y)

In [37]:
print("r =", r)
print("p =", p)

r = 0.826178397950242
p = 0.0

In [38]:
print(f'''
Because p ({p}) < alpha (.05), we reject the null hypothesis that there is
no linear relationship between tenure and monthly charges.
''')

Because p (0.0) < alpha (.05), we reject the null hypothesis that there is
no linear relationship between tenure and monthly charges.

$H_0$ - There is no linear correlation between tenure and monthly charges if we control by phone services only

$H_a$ - There is linear correlation between tenure and monthly charges if we control by phone services only

In [39]:
has_phone_service = telco_churn[telco_churn.phone_service == "Yes"]

In [40]:
has_internet_service = telco_churn[telco_churn.internet_service_type_id	 < 3]

In [41]:
phone_service_only = has_phone_service[has_phone_service.internet_service_type_id == 3]

In [42]:
x = phone_service_only.tenure
y = phone_service_only.total_charges

In [43]:
r, p = stats.pearsonr(x, y)

In [44]:
print("r =", r)
print("p =", p)

r = 0.9815669784401058
p = 0.0

In [45]:
print(f'''
Because p ({p}) < alpha (.05), we reject the null hypothesis that There is no linear correlation between tenure and 
monthly charges if we control by phone services only
''')

Because p (0.0) < alpha (.05), we reject the null hypothesis that There is no linear correlation between tenure and
monthly charges if we control by phone services only

$H_0$ - There is no linear correlation between tenure and monthly charges if we control by internet services only

$H_a$ - There is linear correlation between tenure and monthly charges if we control by internet services only

In [46]:
has_internet_service_only = has_internet_service[has_internet_service.phone_service == "No"]

In [47]:
x = has_internet_service_only.tenure
y = has_internet_service_only.total_charges

In [48]:
r, p = stats.pearsonr(x, y)

In [49]:
print("r =", r)
print("p =", p)

r = 0.9535697728407464
p = 0.0

In [50]:
print(f'''
Because p ({p}) < alpha (.05), we reject the null hypothesis that There is no linear correlation between tenure and 
monthly charges if we control by internet services only
''')

Because p (0.0) < alpha (.05), we reject the null hypothesis that There is no linear correlation between tenure and
monthly charges if we control by internet services only

2. Use the employees database.
    - Is there a relationship between how long an employee has been with the company and their salary?
    - Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [51]:
url = get_db_url("employees")

In [52]:
query ='''SELECT emp_no,
dept_no,
salary,
salaries.to_date,
salaries.from_date,
hire_date
FROM salaries
JOIN dept_emp USING(emp_no)
JOIN employees USING(emp_no);'''

In [53]:
emp_salaries = pd.read_sql(query, url)

In [54]:
emp_salaries.sample(100)

         emp_no dept_no  salary     to_date   from_date   hire_date
2223492  412289    d007   77273  1990-04-24  1989-04-24  1986-04-25
836441    89706    d002   58106  2000-08-31  1999-09-01  1999-01-24
1585325  251183    d005   61621  2000-09-20  1999-09-21  1990-09-23
1440014  237290    d004   64773  2001-06-05  2000-06-05  1989-06-08
307784    39339    d003   64690  1993-08-07  1992-08-07  1990-05-17
619881    69072    d008   42483  1991-08-04  1990-08-04  1990-08-04
467983    54596    d004   47398  1999-07-25  1998-07-25  1992-08-15
2011344  291947    d005   59373  1996-08-20  1995-08-21  1992-08-21
1605633  253086    d004   50106  2001-07-04  2000-07-04  1985-12-17
2111958  401540    d004   70424  1994-03-23  1993-03-23  1986-03-25
1723625  264323    d004   42622  2000-01-06  1999-01-06  1989-07-10
3036871  489889    d006   67898  1992-11-03  1991-11-04  1986-11-05
555648    62956    d007   70911  1999-05-29  1998-05-29  1989-05-31
1421310  235494    d004   81006  1995-08-09  1994-08-09  1991-08-10
2545438  443004    d007   74975  1996-05-17  1995-05-18  1988-05-19
921135    97746    d009   71664  2000-11-16  1999-11-17  1992-11-18
2153584  405579    d007   73391  2000-11-19  1999-11-20  1985-11-27
2837041  470830    d001   46008  1998-08-17  1997-08-17  1986-01-19
953569   100829    d002   63551  1992-12-29  1991-12-30  1985-12-31
2012920  292094    d004   72967  2000-02-17  1999-02-17  1986-11-10
714411    78106    d007   76499  1989-11-09  1988-11-09  1986-11-10
1553613  248163    d004   56128  1998-07-13  1998-05-05  1992-05-06
663072    73220    d004   63128  1995-05-02  1994-05-02  1985-05-04
1319852  225706    d009   97739  1989-06-01  1988-06-01  1987-06-02
1990260  289939    d007   62110  1996-12-23  1995-12-24  1995-12-24
214709    30425    d007  101052  2001-10-25  2000-10-25  1988-10-28
892836    95074    d007   83620  2000-09-16  1999-09-17  1989-09-19
3021656  488439    d005   59228  2000-08-30  1999-08-31  1994-09-01
710649    77749    d005   62721  1997-01-30  1996-01-31  1988-02-02
1402163  233632    d002   85742  2001-12-29  2000-12-29  1990-11-19
1336852  227350    d007   48003  1995-04-17  1994-04-17  1990-04-18
1684338  260601    d004   41947  1992-04-19  1991-04-20  1986-08-14
640916    71084    d005   61561  1999-11-01  1998-11-01  1985-09-09
578010    65090    d005   68596  1999-11-06  1998-11-06  1987-11-09
467635    54561    d009   73048  1999-07-05  1998-07-05  1991-03-24
2413286  430378    d007   67130  1991-09-20  1990-09-20  1985-09-21
168332    26057    d001   43515  1999-04-19  1998-04-19  1994-12-10
3012867  487618    d004   60347  1998-05-10  1997-05-10  1987-05-13
2561528  444533    d003   50273  1994-02-01  1993-02-01  1987-02-03
2866913  473656    d005   58368  2000-07-24  1999-07-25  1990-07-27
820155    88153    d003   44949  1998-12-13  1997-12-13  1990-11-29
893133    95100    d007   75945  2000-10-28  1999-10-29  1987-10-04
2018823  292658    d005   65629  2000-11-08  1999-11-09  1988-11-11
1689103  261054    d004   75765  2001-08-19  2000-08-19  1994-08-21
2058569  296431    d009   77952  1992-03-16  1991-03-17  1985-03-18
3085268  494533    d007   77841  9999-01-01  2001-12-29  1987-01-02
1432029  236518    d003   52160  1990-02-15  1989-02-15  1986-09-01
60181     15750    d004   53748  1999-11-12  1998-11-12  1986-11-29
2316006  421095    d004   58648  2000-12-14  1999-12-15  1988-03-22
754574    81910    d005   48441  2001-04-23  2000-04-23  1987-04-14
556170    63008    d009   83787  2002-01-04  2001-01-04  1986-01-08
875907    93434    d001   75196  2001-03-05  2000-03-05  1992-03-07
2304437  419987    d004   75579  9999-01-01  2002-01-05  1994-09-24
1558505  248625    d004   47089  1995-09-15  1994-09-15  1987-04-18
922518    97883    d004   47381  1996-03-30  1995-03-31  1988-03-30
44801     14270    d004   53313  1998-04-03  1997-04-03  1994-04-01
1768169  268657    d004   58608  1996-10-01  1995-10-02  1989-10-03
2799675  467185    d004   69663  1991-10-13  1990-10-13  1990-10-13
1561920  248961    d006   39880  1997-02-20  1996-02-21  1992-09-24
132985    22696    d004   60148  1993-12-22  1992-12-22  1986-12-24
2105164  400882    d009   43680  1988-05-03  1987-05-04  1987-05-04
913285    96996    d004   76081  1998-06-07  1997-06-07  1987-06-10
2173707  407519    d004   50166  1993-02-01  1992-02-02  1986-08-21
1994614  290376    d002   91512  1995-10-12  1994-10-12  1990-10-13
2564380  444821    d005   74567  1995-08-25  1994-08-25  1987-08-27
78957     17525    d004   61334  2001-10-15  2000-10-15  1990-10-18
2518328  440374    d005   43854  1992-12-17  1991-12-18  1989-12-18
2298742  419457    d004   79502  1998-12-14  1997-12-14  1992-12-15
2972724  483814    d005   58611  1993-07-05  1992-07-05  1987-07-07
1311402  224886    d002   75772  2001-05-16  2000-05-16  1993-05-18
592174    66434    d004   43590  1996-03-02  1995-03-03  1986-01-15
2627973  450824    d004   70313  1997-12-10  1996-12-10  1985-06-28
1654619  257808    d007   81949  9999-01-01  2001-08-20  1985-08-22
1807554  272434    d004   72244  1998-09-12  1997-09-12  1985-09-15
285394    37222    d003   48129  2002-06-21  2001-06-21  1989-12-03
312131    39747    d005   61698  2001-03-22  2000-03-22  1988-03-25
3045526  490730    d007   80534  1999-05-07  1998-05-07  1985-10-12
910920    96764    d007  112496  2002-04-21  2001-04-21  1988-10-17
2808730  468050    d004   69433  1995-08-07  1994-08-07  1989-08-08
2314713  420972    d005   78528  2000-03-25  1999-03-26  1985-05-15
2755890  463015    d001   59019  1999-04-17  1998-04-17  1987-04-26
1879532  279374    d005   70674  2001-04-10  2000-04-10  1987-04-14
1717696  263768    d004   56793  1994-10-26  1993-10-26  1989-11-12
2055455  296156    d005   76622  1996-03-07  1995-03-08  1987-05-18
1230691  217153    d009   41007  1998-02-17  1997-02-17  1990-08-25
639089    70906    d005   83774  1992-05-12  1991-05-13  1985-05-14
288923    37555    d007   64100  1994-08-17  1993-08-17  1993-08-17
557133    63107    d009  103120  9999-01-01  2002-01-14  1986-01-18
580753    65349    d004   90753  2001-06-25  2000-06-25  1987-06-29
798003    86064    d008   54472  1996-09-07  1995-09-08  1991-09-29
2315261  421032    d004   47930  1989-04-10  1988-04-10  1985-04-11
1472957  240419    d005   42237  1988-08-11  1987-08-12  1986-08-12
707650    77467    d006   67874  2001-06-21  2000-06-21  1985-06-25
286623    37337    d007  115379  2002-07-14  2001-07-14  1985-07-18
712577    77936    d005   44754  1989-12-18  1988-12-18  1986-12-19
2137035  403965    d005   59982  1989-11-23  1988-11-23  1985-11-24
1872739  278721    d006   75850  2002-05-19  2001-05-19  1988-05-22
766067    83018    d004   40000  1988-12-20  1987-12-21  1987-12-21
263591    35119    d004   71839  2001-02-13  2000-02-14  1989-02-16
1226090  216705    d005   41478  1988-10-30  1987-10-31  1986-10-31

In [55]:
emp_salaries["number_of_days"] = emp_salaries.to_date - emp_salaries.hire_date

In [56]:
emp_salaries["number_of_days_as_str"] = emp_salaries["number_of_days"].astype("str")

In [57]:
emp_salaries

,emp_no,dept_no,salary,to_date,from_date,hire_date,number_of_days,number_of_days_as_str
0,10001,d005,60117,1987-06-26,1986-06-26,1986-06-26,"365 days, 0:00:00","365 days, 0:00:00"
1,10001,d005,62102,1988-06-25,1987-06-26,1986-06-26,"730 days, 0:00:00","730 days, 0:00:00"
2,10001,d005,66074,1989-06-25,1988-06-25,1986-06-26,"1095 days, 0:00:00","1095 days, 0:00:00"
3,10001,d005,66596,1990-06-25,1989-06-25,1986-06-26,"1460 days, 0:00:00","1460 days, 0:00:00"
4,10001,d005,66961,1991-06-25,1990-06-25,1986-06-26,"1825 days, 0:00:00","1825 days, 0:00:00"
...,...,...,...,...,...,...,...,...
3142090,499999,d004,63707,1998-11-30,1997-11-30,1997-11-30,"365 days, 0:00:00","365 days, 0:00:00"
3142091,499999,d004,67043,1999-11-30,1998-11-30,1997-11-30,"730 days, 0:00:00","730 days, 0:00:00"
3142092,499999,d004,70745,2000-11-29,1999-11-30,1997-11-30,"1095 days, 0:00:00","1095 days, 0:00:00"
3142093,499999,d004,74327,2001-11-29,2000-11-29,1997-11-30,"1460 days, 0:00:00","1460 days, 0:00:00"
3142094,499999,d004,77303,9999-01-01,2001-11-29,1997-11-30,"2922337 days, 0:00:00","2922337 days, 0:00:00"

In [58]:
emp_salaries["number_of_days_as_str"] = emp_salaries["number_of_days_as_str"].str.replace("days","").str.replace(",","")

In [59]:
emp_salaries["number_of_days_as_str"] = emp_salaries["number_of_days_as_str"].str.replace("0:00:00", "").str.replace(" ","")

In [60]:
emp_salaries["number_of_days_as_str"] = emp_salaries["number_of_days_as_str"].str.replace("day", "")

In [61]:
emp_salaries["total_days"] = pd.to_numeric(emp_salaries["number_of_days_as_str"])

In [62]:
emp_salaries = emp_salaries.dropna()

In [63]:
emp_salaries.describe()

             emp_no        salary    total_days
count  3.142090e+06  3.142090e+06  3.142090e+06
mean   2.530825e+05  6.380541e+04  2.495395e+05
std    1.618768e+05  1.690085e+04  8.125960e+05
min    1.000100e+04  3.862300e+04  1.000000e+00
25%    8.488500e+04  5.050300e+04  1.570000e+03
50%    2.498270e+05  6.113900e+04  2.920000e+03
75%    4.249720e+05  7.418000e+04  4.380000e+03
max    4.999990e+05  1.582200e+05  2.927053e+06

$H_0$ - There is no linear relationship between how long an employee has been with the company and their salary

$H_2$ - There is no linear relationship between how long an employee has been with the company and their salary

In [64]:
x = emp_salaries.total_days
y = emp_salaries.salary

In [65]:
r, p = stats.pearsonr(x, y)

In [66]:
print("r =", r)
print("p =", p)

r = 0.1480420573559924
p = 0.0

In [67]:
print(f'''
Because p ({p}) < alpha (.05), we reject the null hypothesis that 
there is no linear relationship between how long an employee has been 
with the company and their salary
''')

Because p (0.0) < alpha (.05), we reject the null hypothesis that
there is no linear relationship between how long an employee has been
with the company and their salary

# Chi Square

1. Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

In [70]:
index = ["Uses a Macbook", "Doesn't Use A Macbook"]
columns = ["Codeup Student", "Not Codeup Student"]

observed = pd.DataFrame([[49, 20], [1, 30]], index=index, columns=columns)

In [71]:
observed

                       Codeup Student  Not Codeup Student
Uses a Macbook                     49                  20
Doesn't Use A Macbook               1                  30

$H_0$ Using a MacBook and being a Codeup student are independent of each other

$H_a$ Using a MacBook and being a Codeup student are dependent of each other

In [75]:
alpha = .05

In [72]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

In [73]:
chi2

36.65264142122487

In [74]:
p

1.4116760526193828e-09

In [76]:
print(f'''
Because p ({p:.9f}) < alpha ({alpha}), we reject the null hypothesis''')

Because p (0.000000001) < alpha (0.05), we reject the null hypothesis

2. Choose another 2 categorical variables from the mpg dataset and perform a chi2 contingency table test with them. Be sure to state your null and alternative hypotheses.

In [78]:
mpg = data("mpg")

In [79]:
mpg.sample(10)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
47,dodge,caravan 2wd,3.8,2008,6,auto(l6),f,16,23,r,minivan
30,chevrolet,k1500 tahoe 4wd,5.3,2008,8,auto(l4),4,11,14,e,suv
105,honda,civic,1.8,2008,4,manual(m5),f,26,34,r,subcompact
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
65,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,12,16,r,pickup
18,audi,a6 quattro,4.2,2008,8,auto(s6),4,16,23,p,midsize
125,jeep,grand cherokee 4wd,4.0,1999,6,auto(l4),4,15,20,r,suv
177,toyota,4runner 4wd,3.4,1999,6,manual(m5),4,15,17,r,suv
184,toyota,camry,3.0,1999,6,auto(l4),f,18,26,r,midsize
207,toyota,toyota tacoma 4wd,4.0,2008,6,auto(l5),4,16,20,r,pickup

In [82]:
mpg.trans = mpg.trans.str[:-4]
mfg_trans = pd.crosstab(mpg.manufacturer, mpg.trans)

$H_0$ Manufacturer and transmission type are independent of each other

$H_a$ Manufacturer and transmission type are independent of each other

In [83]:
chi2, p, degf, expected = stats.chi2_contingency(mfg_trans)

In [90]:
print("chi2 =",chi2)
print("p =", p)
print("degf =", degf)
print("expected =", expected)
print("actual =", mfg_trans)

chi2 = 29.293684393117655
p = 0.00953444310358795
degf = 14
expected = [[12.07692308  5.92307692]
 [12.74786325  6.25213675]
 [24.82478632 12.17521368]
 [16.77350427  8.22649573]
 [ 6.03846154  2.96153846]
 [ 9.39316239  4.60683761]
 [ 5.36752137  2.63247863]
 [ 2.68376068  1.31623932]
 [ 2.01282051  0.98717949]
 [ 2.68376068  1.31623932]
 [ 8.72222222  4.27777778]
 [ 3.35470085  1.64529915]
 [ 9.39316239  4.60683761]
 [22.81196581 11.18803419]
 [18.11538462  8.88461538]]
actual = trans             ma
manufacturer
audi          11   7
chevrolet     16   3
dodge         30   7
ford          17   8
honda          4   5
hyundai        7   7
jeep           8   0
land rover     4   0
lincoln        3   0
mercury        4   0
nissan         8   5
pontiac        5   0
subaru         7   7
toyota        20  14
volkswagen    13  14

In [91]:
print(f'''
Because p ({p:.9f}) < alpha ({alpha}), we reject the null hypothesis''')

Because p (0.009534443) < alpha (0.05), we reject the null hypothesis

3. Use the data from the employees database to answer these questions:

In [92]:
url = get_db_url("employees")

- Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)

$H_0$ An employees gender is independet of working in sales or marketing

$H_a$ An employees gender is independet of working in sales or marketing

In [93]:
sql = """SELECT dept_name,
dept_emp.emp_no,
gender
FROM dept_emp
JOIN departments USING(dept_no)
JOIN employees USING(emp_no)
WHERE to_date > NOW()
AND dept_name IN ("Marketing", "Sales");"""

In [94]:
emp_gender = pd.read_sql(sql, url)

In [95]:
emp_gender

       dept_name  emp_no gender
0      Marketing   10017      F
1      Marketing   10058      M
2      Marketing   10140      F
3      Marketing   10228      F
4      Marketing   10239      F
...          ...     ...    ...
52538      Sales  499966      F
52539      Sales  499976      M
52540      Sales  499980      M
52541      Sales  499986      F
52542      Sales  499987      F

[52543 rows x 3 columns]

In [96]:
ctab = pd.crosstab(emp_gender.dept_name, emp_gender.gender)

In [97]:
ctab

gender         F      M
dept_name
Marketing   5864   8978
Sales      14999  22702

In [99]:
chi2, p, degf, expected = stats.chi2_contingency(ctab)

In [100]:
print("chi2 =",chi2)
print("p =", p)
print("degf =", degf)
print("expected =", expected)

chi2 = 0.3240332004060638
p = 0.5691938610810126
degf = 1
expected = [[ 5893.2426013  8948.7573987]
 [14969.7573987 22731.2426013]]

In [102]:
print(f"""
Because p ({p}) > alpha ({alpha}), we fail to reject the null hypothesis""")

Because p (0.5691938610810126) > alpha (0.05), we fail to reject the null hypothesis

- Is an employee's gender independent of whether or not they are or have been a manager?

In [104]:
sql = """SELECT gender,
emp_no,
title,
to_date
FROM
titles
JOIN employees USING(emp_no);"""

In [105]:
managers = pd.read_sql(sql, url)

In [109]:
managers.sample(10)

       gender  emp_no               title     to_date  Is_manager
271327      M  283453     Senior Engineer  9999-01-01       False
290148      F  296221        Senior Staff  9999-01-01       False
146528      F  108917            Engineer  2000-08-21       False
36843       M   34957        Senior Staff  1999-05-29       False
373044      M  452373            Engineer  1995-06-04       False
358951      M  442853               Staff  1999-02-11       False
420243      M  484308     Senior Engineer  9999-01-01       False
235487      M  259216     Senior Engineer  2002-07-04       False
208487      F  240907        Senior Staff  1996-03-15       False
93374       M   73066  Assistant Engineer  1996-01-27       False

In [118]:
managers["Is_manager"] = managers.title == "Manager"

In [121]:
managers["Is_manager"] = managers.Is_manager.replace(False, "Not Manager").replace(True, "Manager")

In [122]:
managers.sample(10)

       gender  emp_no            title     to_date   Is_manager
174536      M  217826            Staff  1996-06-08  Not Manager
46795       M   41652     Senior Staff  9999-01-01  Not Manager
336502      M  427606         Engineer  1996-03-24  Not Manager
218780      M  247894     Senior Staff  1996-11-11  Not Manager
76542       F   61708  Senior Engineer  1994-08-28  Not Manager
281703      M  290533         Engineer  1995-02-06  Not Manager
416985      M  482089  Senior Engineer  9999-01-01  Not Manager
435576      M  494711         Engineer  1993-12-08  Not Manager
430704      M  491397            Staff  2002-06-13  Not Manager
195942      M  232394            Staff  1997-12-12  Not Manager

$H_0$ - An employees gender is independent of of whether or not they have been or are a manager

$H_a$ - An employees gender is dependent of of whether or not they have been or are a manager

In [123]:
ctab = pd.crosstab(managers.Is_manager, managers.gender)

In [124]:
ctab

gender            F       M
Is_manager
Manager          13      11
Not Manager  177211  266073

In [125]:
chi2, p, degf, expected = stats.chi2_contingency(ctab)

In [126]:
print("chi2 =",chi2)
print("p =", p)
print("degf =", degf)
print("expected =", expected)

chi2 = 1.4658352730039057
p = 0.22600394509880642
degf = 1
expected = [[9.59462947e+00 1.44053705e+01]
 [1.77214405e+05 2.66069595e+05]]

In [127]:
print(f"""
Because p ({p}) > alpha ({alpha}), we fail to reject the null hypothesis""")

Because p (0.22600394509880642) > alpha (0.05), we fail to reject the null hypothesis